Test, Quiz, Note = 0, 0, 0                          # Переменная 'Тип задания', обозначающие номер вопроса.

print('''










        [##################################################]
        [}*| ._   _   ____   _       _        ______    |*{]
        [}*| | | | | |  __| | |     | |      /  __  \   |*{]
        [}*| | |_| | | |__  | |     | |     /  /  \  \  |*{]
        [}*| |  _  | |  __| | |     | |    |  |    |  | |*{]
        [}*| | | | | | |__  | |___  | |___  \  \__/  /  |*{]
        [}*| |_| |_| |____| |_____| |_____|  \______/   |*{]
        [##################################################]''')

while True:                                      # Бесконечный цикл.
    if Test == 0 and Quiz == 0 and Note == 0:       # Если все переменные равны '0', то выводим главный экран. Даём выбрать 'Тип задания'.
        Var = input('''
________________________________________________________________________




{######################################################################}
|                                                                      |
|                             [_Что_вы_выберите?_]                     |
|                                                                      |
|                          |(1)__История_(Тест).                       |
|                          |(2)__Компьютер_(Викторина).                |
|                          |(3)__{_Информация_}                        |
|                                                                      |
{######################################################################}
|                                                                      |
|____________________________(Укажите номер)___________________________|
|___________________________/               \__________________________|
                                    ''')
        if Var == '1':                           # Если выбрал '1', то прибавляем '1' к переменной 'Test', открывая 1-вый вопрос этого Типа задания.
            Test += 1
        elif Var == '2':                         # Если выбрал '2', то прибавляем '1' к переменной 'Quiz', открывая 1-вый вопрос этого Типа задания.
            Quiz += 1
        elif Var == '3':                         #  (-)
            Note += 1

#####################################################################################################

    if Test >= 1 and Quiz == 0 and Note == 0:       # Если Только переменная 'Test' Больше или равна '1', то мы идём по пути вопросов 'Test'.


        if Test == 1:                            # Если переменная 'Test' приравнивается (Строго равнвна) '1', то начинаем 1-вый вопрос.
            Test_1 = str.upper(input('''
                        ._____________________      
                        /                     \     
                        |_Кто основал Москву?_|     
                        \_____________________/     
                                {'''))
            if Test_1 == ('ЮРИЙ ДОЛГОРУКИЙ'):    # 'str.upper' сделает наш введённый ответ стракой с заглавными буквами.
                Test += 1    # Если введёный текст совпадёт с данным ответом, то к переменной 'Test' прибавим '1' и перейдём к следующему вопросу.
                print('''
                        ._____________________      
                        /                     \     
                        |____Молодец *^_^*____|     
                        \_____________________/     
''')
            elif Test_1 == 'EXIT':               # Если введённый текст будет 'EXIT', то обнуляем счётчик и переходим на главный экран.
                Test *= 0
            else:                                # Если не одно из прошлых условий не соблюдено, то задание повторно воспроизводится.
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')
        elif Test == 2:
            Test_2 = str.upper(input('''
            ._______________________________________________        
            /                                               \       
            |_______где находится мовзалей Ленина?__________|       
            |(напишите_название_места_в_именительном_падеже)|       
            \_______________________________________________/       
                                {'''))
            if Test_2 == ('КРАСНАЯ ПЛОЩАДЬ'):
                Test += 1 
                print ('''
                        ._____________________      
                        /                     \     
                        |____Вы_справились!___|     
                        \_____________________/     
''')
            elif Test_2 == 'EXIT':
                Test *= 0
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')
        elif Test == 3:
            Test_3 = str.upper(input(''' 
            ._______________________________________________        
            /                                               \       
            |____В_каком_месяце_празнуется_День_Победы?_____|           
            |(напишите_название_места_в_именительном_падеже)|       
            \_______________________________________________/       
                                {'''))
            if Test_3 == 'МАЙ':
                Test += 1
                print('''
                        ._____________________      
                        /                     \     
                        |___Правильно *^_^*___|     
                        \_____________________/     
''')
            elif Test_3 == 'EXIT':
                Test *= 0
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')                          
        elif Test == 4:                          # Если всезадания все решены, то обнуляем счётчик и переходим на главный экран.
            Test *= 0
            print('''
    ._______________________________________________________________      
    /                                                               \     
    |                                                               |      
    |________________________Тест_пройден___________________________|     
    |                                                               |     
    \_______________________________________________________________/     
''')

#####################################################################################################

    elif Test == 0 and Quiz >= 1 and Note == 0:


        if Quiz == 1:
            Quiz_1 = str.upper(input('''
                    ._________________________________      
                    /                                 \     
                    |_Что является мозгом компьютера?_|     
                    |    (укажите букву варианта)     |     
                    |__(a): Карта памяти              |     
                    |__(b): Процессор                 |     
                    |__(c): Оперативная память        |     
                    \_________________________________/     
                                {'''))
            if Quiz_1 == 'EXIT':
                Quiz *= 0
            elif Quiz_1 == 'B':
                Quiz += 1
                print('''
                        .__________________________      
                        /                          \     
                        |___Хорошо_думаешь *^_^*___|     
                        \__________________________/     
''')
            else:
                print('''
                        .______________________      
                        /                      \     
                        |_____Подумай_ещё______|     
                        \______________________/     
''')
        elif Quiz == 2:
            Quiz_2 = str.upper(input('''
                ._______________________________________      
                /                                       \     
                |_Какого вида охлажденя компьютера нет?_|     
                |       (укажите букву варианта)        |     
                |__(a): Радиаторный                     |     
                |__(b): Жидкостный                      |     
                |__(c): Цифровой                        |     
                |__(d): Воздушный                       |     
                \_______________________________________/     
                                {'''))
            if Quiz_2 == 'EXIT':
                Quiz *= 0
            elif Quiz_2 == 'C':
                Quiz += 1
                print('''
                        .__________________________      
                        /                          \     
                        |_Умеешь_охладиться *^_^*__|     
                        \__________________________/     
''')
            else:
                print('''
                        ._________________________      
                        /                         \     
                        |_Что-то_жарковато_у_тебя_|     
                        \_________________________/     
''')
        elif Quiz == 3:
            Quiz_3 = str.upper(input('''
                ._______________________________________      
                /                                       \     
                |______Что не является перефирией?______|     
                |        (укажите букву варианта)       |     
                |__(a): Наушники                        |     
                |__(b): Монитор                         |     
                |__(c): Микрофон                        |     
                |__(d): Блок_питания                    |     
                \_______________________________________/     
                                {'''))
            if Quiz_3 == 'EXIT':
                Quiz *= 0
            elif Quiz_3 == 'D':
                Quiz += 1
                print('''
                        ._____________________      
                        /                     \     
                        |____Молодец *^_^*____|     
                        \_____________________/     
''')
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')
        elif Quiz == 4:
            Quiz_4 = str.upper(input('''
                .___________________________________      
                /                                   \     
                |____Куда вставляется процессор?____|     
                |      (укажите букву варианта)     |     
                |__(a): Soket                       |     
                |__(b): Sata                        |     
                |__(c): Pci exspress                |     
                |__(d): 4pin cpu                    |     
                \___________________________________/     
                                {'''))
            if Quiz_4 == 'EXIT':
                Quiz *= 0
            elif Quiz_4 == 'A':
                Quiz += 1
                print('''
                        ._____________________      
                        /                     \     
                        |____Красава *^_^*____|     
                        \_____________________/     
''')
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')

        elif Quiz == 5:
            Quiz_5 = str.upper(input('''
                ._____________________________________      
                /                                     \     
                |____Куда устанавливается Windows?____|     
                |        (укажите букву варианта)     |     
                |__(a): Видеокарта                    |     
                |__(b): Флэшка                        |     
                |__(c): HDD_SSD                       |     
                |__(d): DVD Привод                    |     
                \_____________________________________/     
                                {'''))
            if Quiz_5 == 'EXIT':
                Quiz *= 0
            elif Quiz_5 == 'C':
                Quiz += 1
                print('''
                        ._____________________      
                        /                     \     
                        |____Молодец *^_^*____|     
                        \_____________________/     
''')
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')
        elif Quiz == 6:
            Quiz_6 = str.upper(input('''
.________________________________________________________________________________________________      
/                                                                                                \     
|_Как называется соедение служащие для передачи данных между функциональными блоками компьютера?_|     
|                                   (укажите букву варианта)                                     |     
|__(a): Рельса                                                                                   |     
|__(b): Шина                                                                                     |     
|__(c): Кабель                                                                                   |     
|__(d): Провод                                                                                   |     
\________________________________________________________________________________________________/     
                                            {'''))
            
            if Quiz_6 == 'EXIT':
                Quiz *= 0
            elif Quiz_6 == 'B':
                Quiz += 1
                print('''
                        ._____________________      
                        /                     \     
                        |____Молодец *^_^*____|     
                        \_____________________/     
''')
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')
        elif Quiz == 7:
            Quiz_7 = str.upper(input('''
                ._____________________________________________________________      
                /                                                             \     
                |______Какая дисплейная матрица более энергоэффективная?______|     
                |                   (укажите букву варианта)                  |     
                |__(a): Amoled                                                |     
                |__(b): Ips                                                   |     
                |__(c): TFT_TN                                                |     
                \_____________________________________________________________/     
                                {'''))
            if Quiz_7 == 'EXIT':
                Quiz *= 0
            elif Quiz_7 == 'A':
                Quiz += 1
                print('''
                        ._____________________      
                        /                     \     
                        |____Молодец *^_^*____|     
                        \_____________________/     
''')
            else:
                print('''
                        ._____________________      
                        /                     \     
                        |___Повтори_попытку___|     
                        \_____________________/     
''')
        elif Quiz == 8:
            Quiz_8 = str.upper(input('''
                .______________________________________      
                /                                      \     
                |_________Какой процессор мощнее?______|     
                |        (укажите букву варианта)      |     
                |__(a): Intel                          |     
                |__(b): Эльбрус                        |     
                |__(c): AMD                            |     
                |__(d): Байкал                         |     
                \______________________________________/     
                                {'''))
            if Quiz_8 == 'EXIT':
                Quiz *= 0
            elif Quiz_8 == 'A':
                Quiz += 1
                print('''
                        ._____________________      
                        /                     \     
                        |____Синее_братств____|     
                        \_____________________/     
''')
            elif Quiz_8 == 'B':
                Quiz += 1
                print('''
                        .______________________      
                        /                      \     
                        |_Ты_настоящий_патриот_|     
                        \______________________/     
''')
            elif Quiz_8 == 'C':
                Quiz += 1
                print('''
                        ._______________________      
                        /                       \     
                        |____Praise_the_sun!____|     
                        \_______________________/     
''')
            elif Quiz_8 == 'D':
                Quiz += 1
                print('''
                        .____________________________________      
                        /                                    \     
                        |__Наше_озеро_запомнит_твои_подвиги__|     
                        \____________________________________/     
''')

        elif Quiz == 9:
            Quiz *= 0
            print('''
    ._______________________________________________________________      
    /                                                               \     
    |                                                               |      
    |______________________Викторина_пройдена_______________________|     
    |                                                               |     
    \_______________________________________________________________/     
''')


#####################################################################################################

    elif Test == 0 and Quiz == 0 and Note >= 1:
    

        if Note == 1:
            Note_1 = str.upper(input('''
________________________________________________________________________




{######################################################################}
|                                                                      |
|                           [__Информация__]                           |
|                                                                      |
|      * Главный_автор_и_редактор_проекта: Тришкин_Всеволод.           |
|                                                                      |
|      * Помошники_в_разработке(С_самого_начала):                      |
|             {Мурго_Егор; Клишин_Николай; Зимина_Ирина}.              |
|                                                                      |
|      * Куратор_проверявший_проект: Илларионов_И.И.                   |
|                                                                      |
|      * Язык_программирования: Python.                                |
|      * IDLE(Среда_разработки): VSCod.                                |
|                                                                      |
|      * Код_в_открытом_доступе_в_GitHub_Г.автора_проекта: Stepan-7.   |
|                                                                      |
|                                                                      |
|      * Благодарим_за_внимание_уделённое_этому_уроекту.               |
|                                                                      |
|      * Спасибо_всем_участникам_этого_проекта.                        |
|                                                                      |
|                  |(1)__Перейти на главный экран.                     |
|                                                                      |
{######################################################################}
|                                                                      |
|____________________________(Укажите номер)___________________________|
|___________________________/               \__________________________|
                                    '''))
            if Note_1 == '1':
                Note *= 0
                print('''

''')
            else:
                print('')
        elif Note == 2:
            Note *= 0


